Tekla.Structures.ModelInternal.Dstv.DstvBendInfo
The dstv bent line block information.

Tekla.Structures.ModelInternal.Dstv.DstvBendInfo.#ctor
Creates a new DstvBendInfo instance.

Tekla.Structures.ModelInternal.Dstv.DstvBendInfo.FirstPoint
First point of the bent line.

Tekla.Structures.ModelInternal.Dstv.DstvBendInfo.SecondPoint
Second point of the bent line.

Tekla.Structures.ModelInternal.Dstv.DstvBendInfo.Angle
The angle of the bend.

Tekla.Structures.ModelInternal.Dstv.DstvBendInfo.Radius
The radius of the bent.